XKCANO/ceshi0223/KD001-0111/Library/inc/fm33lf0xx_fl_pmu.h
/**
  *******************************************************************************************************
  * @file    fm33lf0xx_fl_pmu.h
  * @author  FMSH Application Team
  * @brief   Head file of PMU FL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2019] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under the Mulan PSL v1.
  * can use this software according to the terms and conditions of the Mulan PSL v1.
  * You may obtain a copy of Mulan PSL v1 at:
  * http://license.coscl.org.cn/MulanPSL
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR
  * IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT, MERCHANTABILITY OR FIT FOR A PARTICULAR
  * PURPOSE.
  * See the Mulan PSL v1 for more details.
  *
  *******************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33LF0XX_FL_PMU_H
#define __FM33LF0XX_FL_PMU_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33lf0xx_fl_def.h"
/** @addtogroup FM33LF0XX_FL_Driver
  * @{
  */

/** @defgroup PMU PMU 
  * @brief PMU FL driver
  * @{
  */

/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup PMU_FL_ES_INIT PMU Exported Init structures
  * @{
  */

/**
  * @brief FL PMU Init Sturcture definition
  */
typedef struct
{
    /*! 低功耗模式配置 */
    uint32_t powerMode;
    /*! 睡眠模式配置 */
    uint32_t deepSleep;
    /*! 唤醒后的系统频率，仅对RCHF */
    uint32_t wakeupFrequency;
    /*! 额外唤醒延迟 */
    uint32_t wakeupDelay;
	/*! Sleep唤醒后STOP的释放控制 */
    uint32_t sleepStop;
} FL_PMU_SleepInitTypeDef;

/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup PMU_FL_Exported_Constants PMU Exported Constants
  * @{
  */

#define    PMU_CR_WKFSEL_Pos                                      (10U)
#define    PMU_CR_WKFSEL_Msk                                      (0x3U << PMU_CR_WKFSEL_Pos)
#define    PMU_CR_WKFSEL                                          PMU_CR_WKFSEL_Msk

#define    PMU_CR_SLPDP_Pos                                       (9U)
#define    PMU_CR_SLPDP_Msk                                       (0x1U << PMU_CR_SLPDP_Pos)
#define    PMU_CR_SLPDP                                           PMU_CR_SLPDP_Msk

#define    PMU_CR_PMOD_Pos                                        (0U)
#define    PMU_CR_PMOD_Msk                                        (0x3U << PMU_CR_PMOD_Pos)
#define    PMU_CR_PMOD                                            PMU_CR_PMOD_Msk

#define    PMU_WKTR_STPCLR_Pos                                    (2U)
#define    PMU_WKTR_STPCLR_Msk                                    (0x1U << PMU_WKTR_STPCLR_Pos)
#define    PMU_WKTR_STPCLR                                        PMU_WKTR_STPCLR_Msk

#define    PMU_WKTR_T1A_Pos                                       (0U)
#define    PMU_WKTR_T1A_Msk                                       (0x3U << PMU_WKTR_T1A_Pos)
#define    PMU_WKTR_T1A                                           PMU_WKTR_T1A_Msk

#define    PMU_WKFR0_RTCWKF_Pos                                   (28U)
#define    PMU_WKFR0_RTCWKF_Msk                                   (0x1U << PMU_WKFR0_RTCWKF_Pos)
#define    PMU_WKFR0_RTCWKF                                       PMU_WKFR0_RTCWKF_Msk

#define    PMU_WKFR0_SVDWKF_Pos                                   (27U)
#define    PMU_WKFR0_SVDWKF_Msk                                   (0x1U << PMU_WKFR0_SVDWKF_Pos)
#define    PMU_WKFR0_SVDWKF                                       PMU_WKFR0_SVDWKF_Msk

#define    PMU_WKFR0_LFDETWKF_Pos                                 (26U)
#define    PMU_WKFR0_LFDETWKF_Msk                                 (0x1U << PMU_WKFR0_LFDETWKF_Pos)
#define    PMU_WKFR0_LFDETWKF                                     PMU_WKFR0_LFDETWKF_Msk

#define    PMU_WKFR0_COMP3WKF_Pos                                 (25U)
#define    PMU_WKFR0_COMP3WKF_Msk                                 (0x1U << PMU_WKFR0_COMP3WKF_Pos)
#define    PMU_WKFR0_COMP3WKF                                     PMU_WKFR0_COMP3WKF_Msk

#define    PMU_WKFR0_IOWKF_Pos                                    (24U)
#define    PMU_WKFR0_IOWKF_Msk                                    (0x1U << PMU_WKFR0_IOWKF_Pos)
#define    PMU_WKFR0_IOWKF                                        PMU_WKFR0_IOWKF_Msk

#define    PMU_WKFR0_I2CSMB1WKF_Pos                               (22U)
#define    PMU_WKFR0_I2CSMB1WKF_Msk                               (0x1U << PMU_WKFR0_I2CSMB1WKF_Pos)
#define    PMU_WKFR0_I2CSMB1WKF                                   PMU_WKFR0_I2CSMB1WKF_Msk

#define    PMU_WKFR0_I2CSMB0WKF_Pos                               (21U)
#define    PMU_WKFR0_I2CSMB0WKF_Msk                               (0x1U << PMU_WKFR0_I2CSMB0WKF_Pos)
#define    PMU_WKFR0_I2CSMB0WKF                                   PMU_WKFR0_I2CSMB0WKF_Msk

#define    PMU_WKFR0_FSCANWKF_Pos                                 (19U)
#define    PMU_WKFR0_FSCANWKF_Msk                                 (0x1U << PMU_WKFR0_FSCANWKF_Pos)
#define    PMU_WKFR0_FSCANWKF                                     PMU_WKFR0_FSCANWKF_Msk

#define    PMU_WKFR0_COMP2WKF_Pos                                 (18U)
#define    PMU_WKFR0_COMP2WKF_Msk                                 (0x1U << PMU_WKFR0_COMP2WKF_Pos)
#define    PMU_WKFR0_COMP2WKF                                     PMU_WKFR0_COMP2WKF_Msk

#define    PMU_WKFR0_COMP1WKF_Pos                                 (17U)
#define    PMU_WKFR0_COMP1WKF_Msk                                 (0x1U << PMU_WKFR0_COMP1WKF_Pos)
#define    PMU_WKFR0_COMP1WKF                                     PMU_WKFR0_COMP1WKF_Msk

#define    PMU_WKFR0_COMP0WKF_Pos                                 (16U)
#define    PMU_WKFR0_COMP0WKF_Msk                                 (0x1U << PMU_WKFR0_COMP0WKF_Pos)
#define    PMU_WKFR0_COMP0WKF                                     PMU_WKFR0_COMP0WKF_Msk

#define    PMU_WKFR0_UART3_LINWKF_Pos                             (15U)
#define    PMU_WKFR0_UART3_LINWKF_Msk                             (0x1U << PMU_WKFR0_UART3_LINWKF_Pos)
#define    PMU_WKFR0_UART3_LINWKF                                 PMU_WKFR0_UART3_LINWKF_Msk

#define    PMU_WKFR0_UART2_LINWKF_Pos                             (14U)
#define    PMU_WKFR0_UART2_LINWKF_Msk                             (0x1U << PMU_WKFR0_UART2_LINWKF_Pos)
#define    PMU_WKFR0_UART2_LINWKF                                 PMU_WKFR0_UART2_LINWKF_Msk

#define    PMU_WKFR0_UART1_LINWKF_Pos                             (13U)
#define    PMU_WKFR0_UART1_LINWKF_Msk                             (0x1U << PMU_WKFR0_UART1_LINWKF_Pos)
#define    PMU_WKFR0_UART1_LINWKF                                 PMU_WKFR0_UART1_LINWKF_Msk

#define    PMU_WKFR0_UART0_LINWKF_Pos                             (12U)
#define    PMU_WKFR0_UART0_LINWKF_Msk                             (0x1U << PMU_WKFR0_UART0_LINWKF_Pos)
#define    PMU_WKFR0_UART0_LINWKF                                 PMU_WKFR0_UART0_LINWKF_Msk

